concert_hub/reserve_service/app/controllers/bronies_controller.rb

  def index
    @bronies = Brony.all
---
SELECT "bronies".* FROM "bronies" ORDER BY "bronies"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def new
    @num = if Brony.last.nil?
---
SELECT "bronies".* FROM "bronies" ORDER BY "bronies"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @num = if Brony.last.nil?
             1
           else
             Brony.last.select(:number_brony).to_i + 1
           end
    @id_bilet = get_id
    @brony = Brony.new(id_ticket: @id_bilet, number_brony: @num, time_broby: Time.now)

    respond_to do |format|
      if @brony.save
---
SELECT "bronies".* FROM "bronies" ORDER BY "bronies"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "bronies" ("id_ticket", "number_brony", "time_broby", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id_ticket", 96], ["number_brony", 1], ["time_broby", "2000-01-01 10:45:16.314128"], ["created_at", "2021-04-16 10:45:16.314846"], ["updated_at", "2021-04-16 10:45:16.314846"]]

  def set_brony
    @brony = Brony.find(params[:id])
---
SELECT "bronies".* FROM "bronies" WHERE "bronies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]