concert_hub/tickets_service/app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("ticket_id", "ticket_category", "data", "status", "fio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save